# CLI Tools
brew "stow"           # Symlink farm manager for dotfiles
brew "fish"           # Friendly interactive shell
brew "neovim"         # Hyperextensible Vim-based text editor
brew "lazygit"        # Simple terminal UI for git commands
brew "gh"             # GitHub CLI
brew "yazi"           # Terminal file manager
brew "zoxide"         # Smarter cd command
brew "atuin"          # Magical shell history
brew "eza"            # Modern replacement for ls
brew "bitwarden-cli"  # Password manager CLI
brew "coreutils"      # GNU core utilities
brew "fd"             # Simple, fast alternative to find
brew "ripgrep"        # Fast grep alternative
brew "fzf"            # Fuzzy finder
brew "jq"             # JSON processor
brew "xh"             # Friendly HTTP client
brew "go"             # Go programming language
brew "ffmpeg"         # Media processing
brew "imagemagick"    # Image manipulation
brew "resvg"          # SVG rendering
brew "poppler"        # PDF rendering library
brew "kubectx"        # Kubernetes context switcher
brew "gemini-cli"     # Gemini AI CLI

# Cask Applications
cask "font-symbols-only-nerd-font"  # Nerd Font symbols
cask "orbstack"                      # Docker/Linux on macOS
cask "ghostty"                       # GPU-accelerated terminal
